Revit 2027 API
Outline(XYZ, XYZ) Constructor
 Constructor that uses a minimum and maximum XYZ point to initialize the outline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Outline(
	XYZ minimumPoint,
	XYZ maximumPoint
)
Public Sub New (
	minimumPoint As XYZ,
	maximumPoint As XYZ
)
public:
Outline(
	XYZ^ minimumPoint,
	XYZ^ maximumPoint
)
new :
        minimumPoint : XYZ *
        maximumPoint : XYZ -> Outline
Parameters
minimumPoint XYZ
 The minimum point
maximumPoint XYZ
 The maximum point.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Outline Class
Outline Overload
Autodesk.Revit.DB Namespace